app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "price" = ?, "title" = ?, "adres" = ?, "photo" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["price", 200], ["title", "ыаыва"], ["adres", "ывываа"], ["photo", ""], ["updated_at", "2018-07-01 14:18:39.386210"], ["id", 1]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update_attributes(article_params)

INSERT INTO "articles" ("title", "text", "rating", "photo", "price", "adres", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["title", "ssdf"], ["text", ""], ["rating", 3], ["photo", ""], ["price", 200], ["adres", "asdasd"], ["created_at", "2018-07-01 14:29:40.163574"], ["updated_at", "2018-07-01 14:29:40.163574"]]
---
    def create
        @article = Article.new(article_params)

        @article.save